Importar librerias

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import pymysql
#paquete para manejar varable de entorno(variable q esta en otra parte del codigo)
from dotenv import load_dotenv
import os

In [2]:
#Desactivar warnings
import warnings
warnings.filterwarnings('ignore')

Conexión a Base de Datos

In [ ]:
import os

def cargar_variables_entorno(archivo):
    # Abrir el archivo de texto con las variables
    with open(archivo, 'r') as file:
        # Leer cada línea y configurar las variables de entorno
        for line in file:
            # Limpiar posibles saltos de línea y separar la clave y valor
            clave, valor = line.strip().split('=')
            os.environ[clave] = valor  # Establecer la variable de entorno

# Llamar a la función con el archivo config.txt
cargar_variables_entorno('C:\\Users\\Public\\PF\\config.txt')

# Ahora puedes acceder a las variables de entorno
host = os.getenv('HOST')
dbName = os.getenv('DB_NAME')
port = int(os.getenv('PORT'))  # Asegúrate de convertir a entero si es necesario
user = os.getenv('USER')
pswd = os.getenv('PASSWORD')

print(f"Host: {host}, DB Name: {dbName}, Port: {port}, User: {user}, Password: {pswd}")

In [4]:
user = os.getenv('USER')
pswd = os.getenv('PASSWORD')
host = os.getenv('HOST')
dbName = os.getenv('DB_NAME')
port = int(os.getenv('PORT'))

try:
    connection = pymysql.connect(host = host, user = user, passwd = pswd, database = dbName, port = port)
    cursor = connection.cursor()
    print (cursor) # Muestra el cursor si todo funciona correctamente

except pymysql.Error as e:
    print("Error en la conexión:", e)

<pymysql.cursors.Cursor object at 0x000001F4CAC62810>

- Tabla aircrafts

In [5]:
#Creación del DF
query = "SELECT * FROM aircrafts_data;"

aircrafts_data = pd.read_sql_query(query, connection)
aircrafts_data.head()

  aircraft_code                                              model  range
0           319  {"en": "Airbus A319-100", "ru": "Аэробус A319-...   6700
1           320  {"en": "Airbus A320-200", "ru": "Аэробус A320-...   5700
2           321  {"en": "Airbus A321-200", "ru": "Аэробус A321-...   5600
3           733    {"en": "Boeing 737-300", "ru": "Боинг 737-300"}   4200
4           763    {"en": "Boeing 767-300", "ru": "Боинг 767-300"}   7900

In [6]:
#Cantidad de filas y columnas
np.shape(aircrafts_data)

(9, 3)

In [7]:
#Consultar cantidad de unicos columna PK
aircrafts_data['aircraft_code'].nunique()

9

In [8]:
#Consultar nulos
aircrafts_data.isnull().sum()

aircraft_code    0
model            0
range            0
dtype: int64

- Tabla airports

In [9]:
#Creación del DF
query = "SELECT * FROM airports_data;"

airports_data = pd.read_sql_query(query, connection)
airports_data.head()

,airport_code,airport_name,city,coordinates,timezone
0,AAQ,"{""en"": ""Anapa Vityazevo Airport"", ""ru"": ""Витяз...","{""en"": ""Anapa"", ""ru"": ""Анапа""}","(37.3473014831539984,45.002101898192997)",Europe/Moscow
1,ABA,"{""en"": ""Abakan Airport"", ""ru"": ""Абакан""}","{""en"": ""Abakan"", ""ru"": ""Абакан""}","(91.3850021362304688,53.7400016784667969)",Asia/Krasnoyarsk
2,AER,"{""en"": ""Sochi International Airport"", ""ru"": ""С...","{""en"": ""Sochi"", ""ru"": ""Сочи""}","(39.9566001892089986,43.4499015808110016)",Europe/Moscow
3,ARH,"{""en"": ""Talagi Airport"", ""ru"": ""Талаги""}","{""en"": ""Arkhangelsk"", ""ru"": ""Архангельск""}","(40.7167015075683594,64.6003036499023438)",Europe/Moscow
4,ASF,"{""en"": ""Astrakhan Airport"", ""ru"": ""Астрахань""}","{""en"": ""Astrakhan"", ""ru"": ""Астрахань""}","(48.0063018799000005,46.2832984924000002)",Europe/Samara

In [10]:
#Cantidad de filas y columnas
np.shape(airports_data)

(104, 5)

In [11]:
#Consultar cantidad de unicos columna PK
airports_data['airport_code'].nunique()

104

In [12]:
#Consultar nulos
airports_data.isnull().sum()

airport_code    0
airport_name    0
city            0
coordinates     0
timezone        0
dtype: int64

- Tabla boarding_passes

In [18]:
#Creación del DF
query = "SELECT * FROM boarding_passes;"

boarding_passes = pd.read_sql_query(query, connection)
boarding_passes.head()

       ticket_no  flight_id  boarding_no seat_no
0  0005432000987      28935           10      7A
1  0005432000988      28935           14     10E
2  0005432000989      28939           27     18E
3  0005432000990      28939            2      3F
4  0005432000991      28913            1      1D

In [14]:
#Cantidad de filas y columnas
np.shape(boarding_passes)

(579686, 4)

In [15]:
# Verificar si las combinaciones son únicas
combinaciones_unicas = not boarding_passes.duplicated(subset=['ticket_no', 'flight_id']).any()

if combinaciones_unicas:
    print("Todas las combinaciones de 'ticket_no' y 'flight_id' son únicas.")
else:
    print("Hay combinaciones duplicadas de 'ticket_no' y 'flight_id'.")

Todas las combinaciones de 'ticket_no' y 'flight_id' son únicas.

In [16]:
#Consultar nulos
boarding_passes.isnull().sum()

ticket_no      0
flight_id      0
boarding_no    0
seat_no        0
dtype: int64

- Tabla bookings

In [19]:
#Creación del DF
query = "SELECT * FROM bookings;"

bookings = pd.read_sql_query(query, connection)
bookings.head()

  book_ref           book_date  total_amount
0   00000F 2017-07-05 03:12:00        265700
1   000012 2017-07-14 09:02:00         37900
2   000068 2017-08-15 14:27:00         18100
3   000181 2017-08-10 13:28:00        131800
4   0002D8 2017-08-07 21:40:00         23600

In [20]:
#Cantidad de filas y columnas
np.shape(bookings)

(262788, 3)

In [21]:
#Consultar cantidad de unicos columna PK
bookings['book_ref'].nunique()

262788

In [22]:
#Consultar nulos
bookings.isnull().sum()

book_ref        0
book_date       0
total_amount    0
dtype: int64

- Tabla flights

In [23]:
#Creación del DF
query = "SELECT * FROM flights;"

flights = pd.read_sql_query(query, connection)
flights.head()

,flight_id,flight_no,scheduled_departure,scheduled_arrival,departure_airport,arrival_airport,status,aircraft_code,actual_departure,actual_arrival
0,1,PG0405,2017-07-16 09:35:00,2017-07-16 10:30:00,DME,LED,Arrived,321,2017-07-16 09:44:00+03,2017-07-16 10:39:00+03
1,2,PG0404,2017-08-05 19:05:00,2017-08-05 20:00:00,DME,LED,Arrived,321,2017-08-05 19:06:00+03,2017-08-05 20:01:00+03
2,3,PG0405,2017-08-05 09:35:00,2017-08-05 10:30:00,DME,LED,Arrived,321,2017-08-05 09:39:00+03,2017-08-05 10:34:00+03
3,4,PG0402,2017-09-09 12:25:00,2017-09-09 13:20:00,DME,LED,Scheduled,321,\N,\N
4,5,PG0405,2017-08-16 09:35:00,2017-08-16 10:30:00,DME,LED,On Time,321,\N,\N

In [25]:
#Cantidad de filas y columnas
np.shape(flights)

(33121, 10)

In [26]:
#Consultar cantidad de unicos columna PK
flights['flight_id'].nunique()

33121

In [27]:
#Consultar nulos
flights.isnull().sum()

flight_id              0
flight_no              0
scheduled_departure    0
scheduled_arrival      0
departure_airport      0
arrival_airport        0
status                 0
aircraft_code          0
actual_departure       0
actual_arrival         0
dtype: int64

- Tabla seats

In [28]:
#Creación del DF
query = "SELECT * FROM seats;"

seats = pd.read_sql_query(query, connection)
seats.head()

  aircraft_code seat_no fare_conditions
0           319     10A         Economy
1           319     10B         Economy
2           319     10C         Economy
3           319     10D         Economy
4           319     10E         Economy

In [29]:
#Cantidad de filas y columnas
np.shape(seats)

(1339, 3)

In [30]:
# Verificar si las combinaciones son únicas
combinaciones_unicas = not seats.duplicated(subset=['aircraft_code', 'seat_no']).any()

if combinaciones_unicas:
    print("Todas las combinaciones de 'aircraft_code' y 'seat_no' son únicas.")
else:
    print("Hay combinaciones duplicadas de 'aircraft_code' y 'seat_no'.")

Todas las combinaciones de 'aircraft_code' y 'seat_no' son únicas.

In [31]:
#Consultar nulos
seats.isnull().sum()

aircraft_code      0
seat_no            0
fare_conditions    0
dtype: int64

- Tabla ticket_flights

In [32]:
#Creación del DF
query = "SELECT * FROM ticket_flights;"

ticket_flights = pd.read_sql_query(query, connection)
ticket_flights.head()

    ticket_no  flight_id fare_conditions  amount
0  5432159776      30625        Business   42100
1  5435212351      30625        Business   42100
2  5435212386      30625        Business   42100
3  5435212381      30625        Business   42100
4  5432211370      30625        Business   42100

In [33]:
#Cantidad de filas y columnas
np.shape(ticket_flights)

(1045726, 4)

In [34]:
# Verificar si las combinaciones son únicas
combinaciones_unicas = not ticket_flights.duplicated(subset=['ticket_no', 'flight_id']).any()

if combinaciones_unicas:
    print("Todas las combinaciones de 'ticket_no' y 'flight_id' son únicas.")
else:
    print("Hay combinaciones duplicadas de 'ticket_no' y 'flight_id'.")

Todas las combinaciones de 'ticket_no' y 'flight_id' son únicas.

In [35]:
#Consultar nulos
ticket_flights.isnull().sum()

ticket_no          0
flight_id          0
fare_conditions    0
amount             0
dtype: int64

- Tabla tickets

In [36]:
#Creación del DF
query = "SELECT * FROM tickets;"

tickets = pd.read_sql_query(query, connection)
tickets.head()

    ticket_no book_ref passenger_id
0  5432000987   06B046  8149 604011
1  5432000988   06B046  8499 420203
2  5432000989   E170C3  1011 752484
3  5432000990   E170C3  4849 400049
4  5432000991   F313DD  6615 976589

In [37]:
#Cantidad de filas y columnas
np.shape(tickets)

(366733, 3)

In [38]:
#Consultar cantidad de unicos columna PK
tickets['ticket_no'].nunique()

366733

In [39]:
#Consultar nulos
tickets.isnull().sum()

ticket_no       0
book_ref        0
passenger_id    0
dtype: int64